# SKPImportOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SKPImportOptions Constructor
SKPImportOptions Class See Also
---
Constructs a new instance of SKPImportOptions with default values of all properties.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public SKPImportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SKPImportOptions()
```

# See Also
SKPImportOptions Class
SKPImportOptions Overload
Autodesk.Revit.DB Namespace